package patterns.flyweight;

import java.util.concurrent.atomic.AtomicInteger;

/**
 * https://www.youtube.com/watch?v=SsCtAmlatsI
 * <p>
 * Легковес (приспособленец) применяется в программе, имеющей большое количество одинаковых объектов. Паттерн разделяет данные этих
 * объектов на две части – легковесы и контексты (внешние и внутренние свойства).
 * Внутренние свойства всегда неизменны, тогда как внешние могут отличаться в зависимости от места и контекста
 * применения и должны быть вынесены за пределы приспособленца
 * <p>
 * Легковес содержит состояние, которое повторялось во множестве первоначальных объектов. Один и тот же легковес можно
 * использовать в связке со множеством контекстов. Состояние, которое хранится здесь, называется внутренним, а то, которое он получает извне – внешним.
 * <p>
 * Контекст содержит «внешнюю» часть состояния, уникальную для каждого объекта. Контекст связан с одним из
 * объектов-легковесов, хранящих оставшееся состояние.
 * <p>
 * Поведение оригинального объекта чаще всего оставляют в Легковесе, передавая значения контекста через параметры методов.
 * Тем не менее поведение можно поместить и в контекст, используя легковес как объект данных.
 * <p>
 * Клиент вычисляет или хранит контекст, то есть внешнее состояние легковесов. Для клиента легковесы выглядят как
 * шаблонные объекты, которые можно настроить во время использования, передав контекст через параметры.
 * <p>
 * Фабрика легковесов управляет созданием и повторным использованием легковесов. Фабрика получает запросы, в которых
 * указано желаемое состояние легковеса. Если легковес с таким состоянием уже создан, фабрика сразу его возвращает, а если нет – создаёт новый объект.
 */
public class FlyweightTest {

	public static void main(String[] args) {

		FlyweightFactory.getSymbol("j", "Arial");
		FlyweightFactory.getSymbol("a", "Arial");
		FlyweightFactory.getSymbol("v", "Arial");
		FlyweightFactory.getSymbol("a", "Arial");


		AtomicInteger counter = new AtomicInteger();
		for (Character c : "java".toCharArray()) {
			PositionContext position = new PositionContext(1, counter.addAndGet(1));
			Drawable drawable = FlyweightFactory.getSymbol(c.toString(), "Arial");
			drawable.draw(position);
		}
	}

}
